{
  "id": "contract-extraction",
  "title": "Contract Data Extraction Service",
  "role": "SDE Applied AI at Adaequare",
  "description": "AI-powered contract intelligence system that extracts structured metadata from various contract types (MSAs, NDAs, service agreements, etc.) into machine-readable JSON. Processes PDF and DOCX using multimodal LLM extraction with template-based validation and quality scoring. This production system became the foundation for domain-specific extraction services—later adapted into a streamlined event flyer extraction pipeline.",
  "contribution": "Architected and built the contract extraction system end-to-end, establishing the patterns and validation workflows that became the template for extraction services across domains.",
  "contributionBullets": [
    "Designed extraction architecture supporting PDF (PyMuPDF) and DOCX (python-docx) with multimodal LLM processing.",
    "Engineered prompt templates with context management, state tracking, and memory optimization for efficient LLM calls.",
    "Implemented validation comparing extracted values to templates with expected answers, deviation detection, and quality scoring (0-100).",
    "Built FastAPI REST API with Pydantic models for request/response validation, async processing, and job status tracking.",
    "Developed field-level validation with match flags (same_as_template, similar_not_exact, different_from_template, flag_for_review, not_found) for automated review.",
    "Created structured JSON schema (v2.0.0) with validation scoring, status indicators, and detailed notes per field.",
    "Optimized LLM context and token usage via chunking and state preservation across extraction stages.",
    "Built CLI for single-file and batch processing with parallel execution.",
    "Developed Streamlit UI for interactive contract review, validation, and extraction management.",
    "Deployed on GCP Cloud Run with Docker and Cloud SQL for persistence.",
    "Established reusable extraction framework that enabled rapid adaptation for event flyer processing (event-flyer-extractor)."
  ],
  "tech": [
    "Python 3.10+",
    "FastAPI",
    "Pydantic",
    "Google Gemini 3 Pro",
    "Google Cloud Vision API",
    "PyMuPDF",
    "python-docx",
    "Streamlit",
    "Docker",
    "GCP Cloud Run",
    "Cloud SQL",
    "PostgreSQL"
  ],
  "link": "https://github.com/keerthanvenkata/msa_extractor",
  "status": "Production",
  "images": [
    "projects/contract-extraction/arch.png",
    "projects/contract-extraction/msa_api.png"
  ],
  "video": null,
  "videoPoster": null,
  "highlights": [
    "Reduces contract review time from 3-4 hours to 15 minutes on average (some edge cases up to 1 hour); processes 5-10 contracts/month in v1.",
    "Enables early discrepancy detection by comparing extracted values against templates with deviation flags.",
    "Multimodal LLM approach (Gemini 3 Pro/Flash) handles both text and image-based contracts, replacing traditional OCR preprocessing.",
    "Template-based validation system with expected answers and deviation detection for automated quality assurance.",
    "Used by Legal, Sales, and Finance teams for contract metadata extraction and CRM automation.",
    "Production-ready architecture deployed on GCP with Docker containerization and Cloud SQL persistence.",
    "Reusable foundation: patterns adapted for domain-specific services (e.g. event flyer extractor)."
  ],
  "relatedProjects": [
    "property-appraisal",
    "tax-roll-pipeline",
    "event-flyer-extractor"
  ],
  "relatedPosts": [
    "llm-patterns",
    "fastapi-practices",
    "contract-intelligence-takeaways"
  ],
  "collaboration": {
    "seeking": false,
    "types": [],
    "contact": "/contact"
  },
  "service": {
    "available": false,
    "description": ""
  },
  "featured": true,
  "kind": "project"
}